{
  "backend/main.mo": "Motoko canister implementing user profiles, posts with images and tags, access control, feed retrieval, and basic messaging storage.",
  "feature_evidence.json": "Feature-report JSON mapping implemented features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend files including components, pages, hooks, and configuration.",
  "frontend/index.css": "Tailwind styles defining global OKLCH color variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, auth gating, profile setup flow, and global incoming-call handling.",
  "frontend/src/components/calling/IncomingCallPrompt.tsx": "Displays an alert dialog for incoming voice/video calls with accept and decline actions.",
  "frontend/src/components/discovery/SearchBar.tsx": "Search input form with clear button for submitting text-based post searches.",
  "frontend/src/components/discovery/TagChips.tsx": "Fetches and displays selectable tag badges for filtering posts by tag.",
  "frontend/src/components/layout/AppShell.tsx": "Layout shell with navigation, auth handling, and footer; conditionally shows links based on login state and manages login/logout actions.",
  "frontend/src/components/messages/ConversationList.tsx": "Scrollable list of conversations showing user avatars, last messages, and selection handling.",
  "frontend/src/components/messages/MessageThread.tsx": "Displays a chat thread with polling, message sending, and auto-scrolling for a selected user.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a single post preview with image, caption, author info, and timestamp linking to the post page.",
  "frontend/src/components/posts/PostComposer.tsx": "Form for creating a new post with image upload, caption, tags, and upload progress.",
  "frontend/src/components/profile/ProfileEditor.tsx": "Editor form for updating a user's display name, bio, and avatar with image upload support.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile creation dialog prompting for display name and bio on first login.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useCallSignaling.ts": "Zustand store managing incoming and active call state with polling placeholder logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider wrapping Dfinity AuthClient to load, manage, and expose Internet Identity state.",
  "frontend/src/hooks/usePolling.ts": "Custom hook that runs a callback on a setInterval when enabled.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor calls for profiles, posts, tags, and messages with cache updates.",
  "frontend/src/hooks/useWebRTCCall.ts": "Manages local media, mute/camera toggles, and connection state for a simple WebRTC call.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "App entry setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/CallPage.tsx": "Call UI page connecting WebRTC state with user profile and call controls.",
  "frontend/src/pages/CreatePostPage.tsx": "Page wrapping the PostComposer component and navigating back on success.",
  "frontend/src/pages/FeedPage.tsx": "Feed display with search, tags, and post results gated by Internet Identity authentication.",
  "frontend/src/pages/MessagesPage.tsx": "Renders the messaging layout with a conversation list and message thread, currently using an empty placeholder conversation list.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with image, author info, tags, and call/message actions, fetching the post from the feed by ID.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user's profile with avatar, bio, posts, and messaging/calling options, including an edit dialog for the owner.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using both query strings and hash routing with sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project metadata, features, requirements, and image asset needs for the inspiration-sharing app."
}